app/controllers/administrators_controller.rb

SELECT * FROM `administrators` WHERE (`administrators`.`id` IS NULL) LIMIT 1
---
  def index
    @administrators = Administrator.find(:all, :order => :name)