app/controllers/books_controller.rb

  def index
    @books = Book.all(:order => "name")
---
SELECT * FROM `books` ORDER BY name

  def show
    begin
      @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 4)

  def edit
    @book = Book.find(params[:id])
---
SELECT * FROM `books` WHERE (`books`.`id` = 4)