app/controllers/books_categories_controller.rb

  def index
    @books_categories = BooksCategory.all(:order => "name")
---
SELECT * FROM `books_categories` ORDER BY name

  def show
    @books_category = BooksCategory.find(params[:id])
---
SELECT * FROM `books_categories` WHERE (`books_categories`.`id` = 3)

  def create
    @books_category = BooksCategory.new(params[:books_category])

    respond_to do |format|
      if @books_category.save
---
INSERT INTO `books_categories` (`name`, `description`, `created_at`, `updated_at`) VALUES('Biology', 'Bio', '2011-07-01 06:59:20', '2011-07-01 06:59:20')