app/controllers/bookshop_controller.rb

SELECT * FROM `books_categories` ORDER BY name
---
  def index
    @books_categories = BooksCategory.all(:order => "name")

SELECT * FROM `books` WHERE (name LIKE '%normal gets you nowhere%' OR description LIKE '%normal gets you nowhere%')
---
  def bsearch
    @cart = find_cart
    @books = Book.search(params[:search])

SELECT * FROM `books_categories` ORDER BY name
---
  def downl_fmaterials
    @books_categories = BooksCategory.all(:order => "name")

SELECT * FROM `books_categories` WHERE (`books_categories`.`id` = 1)
---
  def show_dcat
    @cart = find_cart
    @books_category = BooksCategory.find(params[:id])

SELECT * FROM `books_categories` WHERE (`books_categories`.`id` = 1)
---
  def showcat
    @cart = find_cart
    @books_category = BooksCategory.find(params[:id])

SELECT * FROM `books` WHERE (`books`.`id` = 4)
---
  def add_to_cart
    begin
      book = Book.find(params[:id])

INSERT INTO `line_items` (`book_id`, `order_id`, `quantity`, `total_price`, `created_at`, `updated_at`) VALUES(4, 1, 1, '1200.0', '2011-06-16 07:25:24', '2011-06-16 07:25:24')
INSERT INTO `orders` (`user_id`, `created_at`, `updated_at`) VALUES(2, '2011-06-16 07:25:24', '2011-06-16 07:25:24')
SELECT * FROM `orders` ORDER BY orders.id DESC LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT sum(`line_items`.total_price) AS sum_total_price FROM `line_items` WHERE (`line_items`.`order_id` = 1)
INSERT INTO `ozekimessageouts` (`order_id`, `sender`, `receiver`, `msg`, `senttime`, `receivedtime`, `status`) VALUES(2, '+254713973902', '+254713973902', 'Thank you Peter Githoge for your purchase. Please send KSh.3840.0 to +25713973902 (mpesa) to complete the trasaction. More info. Banta.co.ke/bs', NULL, '2011-06-16 10:25:24', 'send')
---
  def save_order
    @cart = find_cart
    if @cart.items.empty?
      flash[:notice] = "Your cart is empty"
    else
      @order = Order.new
      @ozekimessageout = Ozekimessageout.new
      @transaction = Transaction.new
    end
    #***************************************************************************
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.user_id = session[:user_id]

    @order.add_line_items_from_cart(@cart)

    if @order.save
      @ozekimessageout = Ozekimessageout.new(params[:ozekimessageout])
      @ozekimessageout.order_id = Order.last.id + 1
      @ozekimessageout.sender = "+254713973902"
      @ozekimessageout.receiver = "+#{User.find(session[:user_id]).mpesa_no}"
      $gt = LineItem.sum(:total_price, :conditions => {:order_id => (Order.last.id)})
      @ozekimessageout.msg = "Thank you #{User.find(session[:user_id]).name} for your purchase. Please send KSh.#{$gt} to +254704801935 (mpesa) to complete the trasaction. More info. BantaBookstore.com"
      $tm = Time.now
      @ozekimessageout.receivedtime = $tm
      @ozekimessageout.status = "send"

      if  @ozekimessageout.save

SELECT * FROM `ozekimessageins` ORDER BY ozekimessageins.id DESC LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `ozekimessageins` WHERE (`ozekimessageins`.`id` = 1)
SELECT * FROM `orders` ORDER BY orders.id DESC LIMIT 1
INSERT INTO `transactions` (`order_id`, `name`, `pnumber`, `amount`, `status`, `created_at`, `updated_at`) VALUES(1, 'Peter Githoge', '254713973902', 3840, 'Processed', '2011-06-16 07:31:42', '2011-06-16 07:31:42')
---
  def sms_in
    @transaction = Transaction.new(params[:transaction])
    @cart = find_cart
    $i = 1;
    $num = Ozekimessagein.last.id;
    $uid = User.find(session[:user_id]).id
    until $i > $num  do
      $fr = Ozekimessagein.find($i).sender
      $msg = Ozekimessagein.find($i).msg
      $name = User.find(session[:user_id]).name.upcase
      $m_no = "#{User.find(session[:user_id]).mpesa_no}"

      if $fr == "+254713973902"
        $ksh = $msg.split(" ")[5][3,$msg.split(" ")[5].size].delete(",").to_i #split, 5th element,remove "Ksh", remove ",", change to integer
      else
        $ksh = 0
      end
      if $fr == "+254713973902" and $msg.include?("#{$name}") and $msg.include?("#{$m_no}") and $ksh >= $gt and (Ozekimessagein.find($i).senttime.to_datetime) > (Time.now - 172800)
        @transaction.order_id = Order.last.id
        @transaction.name = User.find(session[:user_id]).name
        @transaction.pnumber = User.find(session[:user_id]).mpesa_no
        @transaction.amount = $gt
        @transaction.status = "Processed"
        if  @transaction.save

INSERT INTO `ozekimessageouts` (`order_id`, `sender`, `receiver`, `msg`, `senttime`, `receivedtime`, `status`) VALUES(2, '+254713973902', '+254713973902', 'Thank you Peter Githoge for your purchase. Your books will be delivered to Nakuru on Sun Jun 19 10:31:42 +0300 2011. More info. Banta.co.ke/bs', NULL, '2011-06-16 10:31:42', 'send')
---
          $tm = Time.now
          @ozekimessageout.receivedtime = $tm
          @ozekimessageout.status = "send"
          if  @ozekimessageout.save