app/controllers/free_books_controller.rb

SELECT * FROM `free_books` ORDER BY title
---
  def index
    @free_books = FreeBook.all(:order => "title")

SELECT * FROM `free_books` WHERE (`free_books`.`id` = 3)
---
  def show
    @free_book = FreeBook.find(params[:id])

SELECT * FROM `free_books` WHERE (`free_books`.`id` = 3)
---
  def edit
    @free_book = FreeBook.find(params[:id])

INSERT INTO `free_books` (`picture`, `title`, `book_url`, `author`, `description`, `books_category_id`, `created_at`, `updated_at`) VALUES('050710_2203_ScrumAnIntr1.gif', 'Intro. scrum', 'introduction-to-agile-scrum2224.ppt', 'Peter Copper', 'Talks about the scrum methodology.', 1, '2011-06-16 09:10:25', '2011-06-16 09:10:25')
---
  def create
    @free_book = FreeBook.new(params[:free_book])

    pic = params[:free_book][:picture]
    @free_book.picture = pic.original_filename
    FileUtils.copy(pic.local_path, "#{RAILS_ROOT}/public/fbooks_pics/#{pic.original_filename}")

    book_st = params[:free_book][:book_url]
    @free_book.book_url = book_st.original_filename
    FileUtils.copy(book_st.local_path, "#{RAILS_ROOT}/public/fbooks_st/#{book_st.original_filename}")

    respond_to do |format|
      if @free_book.save