app/controllers/order_trn_controller.rb

  def s_transac
    @order = Order.find(params[:id])
---
SELECT * FROM `orders` WHERE (`orders`.`id` = 1)