app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `mpesa_no`, `email`, `address`, `town`, `hashed_password`, `salt`, `created_at`, `updated_at`) VALUES('joseph wanzala', '254728770401', 'adrianamwakira@yahoo.com', '700', 'nairobi', '7bb462ba1d4ca0b51fee255c290ef705775c8712', '187000.192817843127592', '2011-06-16 11:13:44', '2011-06-16 11:13:44')